__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
MRI (InputLayer)                (None, 7)            0                                            
__________________________________________________________________________________________________
PET (InputLayer)                (None, 3)            0                                            
__________________________________________________________________________________________________
COG (InputLayer)                (None, 20)           0                                            
__________________________________________________________________________________________________
CSF (InputLayer)                (None, 3)            0                                            
__________________________________________________________________________________________________
RF (InputLayer)                 (None, 3)            0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 14)           112         MRI[0][0]                        
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 6)            24          PET[0][0]                        
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 40)           840         COG[0][0]                        
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 6)            24          CSF[0][0]                        
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 6)            24          RF[0][0]                         
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 7)            105         dense[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 3)            21          dense_2[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 20)           820         dense_4[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 3)            21          dense_6[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 3)            21          dense_8[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 36)           0           dense_1[0][0]                    
                                                                 dense_3[0][0]                    
                                                                 dense_5[0][0]                    
                                                                 dense_7[0][0]                    
                                                                 dense_9[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 100)          3700        concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 100)          0           dense_10[0][0]                   
__________________________________________________________________________________________________
reshape (Reshape)               (None, 10, 10, 1)    0           dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1 (BatchNo (None, 10, 10, 1)    4           reshape[0][0]                    
__________________________________________________________________________________________________
Leaky_ReLU (Lambda)             multiple             0           batch_normalization_v1[0][0]     
                                                                 batch_normalization_v1_1[0][0]   
                                                                 batch_normalization_v1_2[0][0]   
                                                                 batch_normalization_v1_3[0][0]   
                                                                 batch_normalization_v1_6[0][0]   
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 10, 10, 10)   100         Leaky_ReLU[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 10, 10, 10)   100         Leaky_ReLU[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 10, 10, 10)   100         Leaky_ReLU[0][0]                 
__________________________________________________________________________________________________
batch_normalization_v1_1 (Batch (None, 10, 10, 10)   40          conv2d_transpose[0][0]           
__________________________________________________________________________________________________
batch_normalization_v1_2 (Batch (None, 10, 10, 10)   40          conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
batch_normalization_v1_3 (Batch (None, 10, 10, 10)   40          conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 10, 10, 30)   0           Leaky_ReLU[1][0]                 
                                                                 Leaky_ReLU[2][0]                 
                                                                 Leaky_ReLU[3][0]                 
__________________________________________________________________________________________________
batch_normalization_v1_4 (Batch (None, 10, 10, 30)   120         concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 21, 21, 100)  27100       batch_normalization_v1_4[0][0]   
__________________________________________________________________________________________________
batch_normalization_v1_6 (Batch (None, 21, 21, 100)  400         conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 23, 23, 3)    2703        Leaky_ReLU[5][0]                 
__________________________________________________________________________________________________
batch_normalization_v1_7 (Batch (None, 23, 23, 3)    12          conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
activation (Activation)         (None, 23, 23, 3)    0           batch_normalization_v1_7[0][0]   
==================================================================================================
Total params: 36,471
Trainable params: 36,143
Non-trainable params: 328
__________________________________________________________________________________________________